Working with Missing Data in Pandas:

Missing data is a common problem in real-world datasets. It occurs when no information is available for one or more entries, either because the data was not collected or doesn't exist. In Pandas, missing data is represented in two ways:

None: A Python object used for missing values.
NaN (Not a Number): A special floating-point value that indicates missing data.

Pandas treats None and NaN as interchangeable when identifying missing or null values. To work with missing data, Pandas provides several useful functions, including:

isnull()
notnull()
dropna()
fillna()
replace()
interpolate()

Detecting Missing Data:

isnull():
This function returns a DataFrame with Boolean values, where True indicates a missing value (NaN).

In [1]:
import pandas as pd
import numpy as np

In [57]:
d = {'Age': [100, 90, np.nan, 95],
        'weight': [30, 45, 56, np.nan],
        'height': [60, 40, np.nan, 98]}

df = pd.DataFrame(d)

In [59]:
df.isnull()

     Age  weight  height
0  False   False   False
1  False   False   False
2   True   False    True
3  False    True   False

In [61]:
df.isnull().sum()

Age       1
weight    1
height    1
dtype: int64

notnull(): This function returns a DataFrame with Boolean values, where False indicates a missing value (NaN).

In [63]:
# Checking for non-missing values
df.notnull()

     Age  weight  height
0   True    True    True
1   True    True    True
2  False    True   False
3   True   False    True

In [65]:
df.notnull().sum()

Age       3
weight    3
height    3
dtype: int64

Handling Missing Data

1.Filling Missing Values

In [67]:
#fillna(): Replaces missing values with a specified value or strategy.

In [69]:
#Filling with a single value
df.fillna(0)

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0
2    0.0    56.0     0.0
3   95.0     0.0    98.0

In [71]:
df.fillna(1)

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0
2    1.0    56.0     1.0
3   95.0     1.0    98.0

In [73]:
#Filling with the previous value (Forward Fill)
df.fillna(method="pad")

C:\Users\erzub\AppData\Local\Temp\ipykernel_4664\1606023872.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="pad")

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0
2   90.0    56.0    40.0
3   95.0    56.0    98.0

In [75]:
#Filling with the next value (Backward Fill)
df.fillna(method="bfill")

C:\Users\erzub\AppData\Local\Temp\ipykernel_4664\3060536654.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0
2   95.0    56.0    98.0
3   95.0     NaN    98.0

2. Replacing Missing Values

#replace(): Replaces specific values in the DataFrame. You can use it to replace NaN values with something else.

In [77]:
x=df.replace(np.nan,-1)

In [79]:
x

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0
2   -1.0    56.0    -1.0
3   95.0    -1.0    98.0

3. Interpolating Missing Values using interpolate()
The interpolate() function fills in missing values by estimating the value based on other available data points.

In [81]:
y=df.interpolate()

In [83]:
y

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0
2   92.5    56.0    69.0
3   95.0    56.0    98.0

Dropping missing values using dropna()

dropna() function this function drop Rows/Columns of datasets with Null values in different ways.

In [85]:
df.dropna()

     Age  weight  height
0  100.0    30.0    60.0
1   90.0    45.0    40.0

In [98]:
d = {'Age': [100, 90, 55, 95],
        'weight': [30, np.nan, 56, 55],
        'height': [60, 40, np.nan, 98]}

df = pd.DataFrame(d)

In [102]:
df

   Age  weight  height
0  100    30.0    60.0
1   90     NaN    40.0
2   55    56.0     NaN
3   95    55.0    98.0

In [104]:
df.dropna(axis=0)

   Age  weight  height
0  100    30.0    60.0
3   95    55.0    98.0